УНФ_ТЕСТ.BizOn_WMS_MES/src/Catalogs/БЗ_Сотрудники_ТСД/БЗ_Сотрудники_ТСД.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>БЗ_Сотрудники_ТСД</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>ПинКод</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>4</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СканКод</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>12</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Доступ_РедакцияОПС</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Участки</name>
    <attributes>
      <name>Участок</name>
      <type>
        <types>CatalogRef.БЗ_Участки</types>
      </type>
    </attributes>
    <attributes>
      <name>РабочееМесто</name>
      <type>
        <types>CatalogRef.БЗ_РабочиеМеста</types>
      </type>
    </attributes>
    <attributes>
      <name>Ответственный</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>НомерБригады</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДоступныеОперации</name>
    <attributes>
      <name>Операция</name>
      <type>
        <types>EnumRef.БЗ_ТСД_Операции</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

УНФ_ТЕСТ.BizOn_WMS_MES/src/Catalogs/БЗ_Сотрудники_ТСД/Forms/ФормаЭлемента/Module.bsl
&НаСервере
Функция СгенерироватьКод(Длина)
	ТекДата=ТекущаяДата();
	Секунда=Секунда(ТекДата);
	Минута=Минута(текДата);
	Seed=СтрДлина(UserName())+СтрДлина(ComputerName());
	Генератор=Новый ГенераторСлучайныхЧисел(Seed*Секунда*Минута);
	Ответ="";
	Пока СтрДлина(Ответ)<Длина Цикл
		Ответ=Ответ+СокрЛП(Генератор.СлучайноеЧисло(1,9));
	КонецЦикла;
	Возврат Ответ;
КонецФункции

&НаСервере
Процедура СгенерироватьНаСервере(Записывать=Ложь)
	Объект.ПинКод=СгенерироватьКод(4);	
	НайденоСовпадение=Справочники.БЗ_Сотрудники_ТСД.НайтиПоРеквизиту("ПинКод",Объект.ПинКод);
	Пока ЗначениеЗаполнено(НайденоСовпадение) Цикл
		Объект.ПинКод=СгенерироватьКод(4);
		НайденоСовпадение=Справочники.БЗ_Сотрудники_ТСД.НайтиПоРеквизиту("ПинКод",Объект.ПинКод);
	КонецЦикла;
	ГШтрихкод="2800"+СгенерироватьКод(8);
	Объект.СканКод=ГШтрихкод;
	НайденоСовпадение=Справочники.БЗ_Сотрудники_ТСД.НайтиПоРеквизиту("СканКод",Объект.СканКод);
	Пока ЗначениеЗаполнено(НайденоСовпадение) Цикл
		ГШтрихкод="2800"+СгенерироватьКод(8);
		Объект.СканКод=ГШтрихкод;
		НайденоСовпадение=Справочники.БЗ_Сотрудники_ТСД.НайтиПоРеквизиту("СканКод",Объект.СканКод);
	КонецЦикла;	
	Если Записывать Тогда
		Записать();		
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
    Если Параметры.Ключ.Пустая() Тогда
    	СгенерироватьНаСервере();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура Сгенерировать(Команда)
	СгенерироватьНаСервере(Истина);
	ОповеститьОбИзменении(Объект.Ссылка);
КонецПроцедуры

&НаСервере
Функция ПечатьБейджаНаСервере()
	ТабДокумент = Новый ТабличныйДокумент;
	ТабДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_БейджТСД";
	ТабДокумент.ПолеСверху = 12;
	ТабДокумент.ПолеСлева = 10;
	ТабДокумент.ПолеСнизу = 12;
	ТабДокумент.ПолеСправа = 15;
	ТабДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;
	ТабДокумент.ТолькоПросмотр = Истина;
	ТабДокумент.ОтображатьСетку = Ложь;	
	ТабДокумент.ОтображатьЗаголовки=Ложь;	
	ТабДокумент.АвтоМасштаб=Ложь;
	Макет = Справочники.БЗ_Сотрудники_ТСД.ПолучитьМакет("Бейдж");
	ОбластьМакета = Макет.ПолучитьОбласть("Бейдж");
	ОбластьМакета.Параметры.Имя=Объект.Наименование;
	ОбластьМакета.Параметры.ШКод=БЗ_Штрихкодирование.CODE128Строка(Объект.СканКод);
	ТабДокумент.Вывести(ОбластьМакета);		
	
	ЭлементКоллекцииДляПечати = Новый Структура;
	Для Каждого ИмяКолонки Из УправлениеПечатьюКлиентСервер.ИменаПолейКоллекцииПечатныхФорм() Цикл
		ЭлементКоллекцииДляПечати.Вставить(ИмяКолонки);
	КонецЦикла;
	ЭлементКоллекцииДляПечати.ТабличныйДокумент = ТабДокумент;
	ЭлементКоллекцииДляПечати.СинонимМакета = "Печать бейджа авторизации (Сотрудника ТСД)";
	ЭлементКоллекцииДляПечати.ИмяМакета = "ПечатьБейджаАвторизацииСотрудникаТСД";
	ЭлементКоллекцииДляПечати.ИмяВРЕГ = ЭлементКоллекцииДляПечати.ИмяМакета;
	ЭлементКоллекцииДляПечати.Экземпляров = 1;
	
	СтруктураВозврат = Новый Структура;
	СтруктураВозврат.Вставить("ЭлементКоллекцииДляПечати", ЭлементКоллекцииДляПечати);
	МассивОбъектов = Новый Массив;
	СтруктураВозврат.Вставить("ИсточникДанных", МассивОбъектов);	
	Возврат СтруктураВозврат;	
КонецФункции

&НаКлиенте
Процедура ПечатьБейджа(Команда)	
	СтруктураВозврат = ПечатьБейджаНаСервере();
	
	КоллекцияПечатныхФорм = Новый Массив;
	КоллекцияПечатныхФорм.Добавить(СтруктураВозврат.ЭлементКоллекцииДляПечати);
	
	ПараметрыПечати = Новый Структура;
	ПараметрыПечати.Вставить("ПереопределитьПользовательскиеНастройкиКоличества", Истина);
	
	ПараметрыОткрытия = Новый Структура("КоллекцияПечатныхФорм,ИсточникДанных,ПараметрыПечати");
	ПараметрыОткрытия.КоллекцияПечатныхФорм = КоллекцияПечатныхФорм;
	ПараметрыОткрытия.ИсточникДанных = КоллекцияПечатныхФорм;
	ПараметрыОткрытия.ПараметрыПечати	 = ПараметрыПечати;
	
	ОткрытьФорму("ОбщаяФорма.ПечатьДокументов", ПараметрыОткрытия, ЭтаФорма, Строка(Новый УникальныйИдентификатор));	
КонецПроцедуры
